app/Controllers/AdminController.php

    public function index()
    {
        $model = new PengumumanModel;
        $data['data_pengumuman'] = $model->findAll();
---
SELECT *
FROM `pengumuman`

    public function tambahPengumuman()
    {
        $judul = $this->request->getPost('judul');
        $konten = $this->request->getPost('konten');
        $tgl_pengumuman = $this->request->getPost('tgl_pengumuman');

        $model = new PengumumanModel();
        $data = [
            'judul' => $judul,
            'konten' => $konten,
            'tgl_pengumuman' => $tgl_pengumuman
        ];
        $model->insert($data);
---
INSERT INTO `pengumuman` (`judul`, `konten`, `tgl_pengumuman`) VALUES ('Pengumuman Beasiswa Prestasi Semester Ganjil 2023/2024', 'Diberitahukan kepada seluruh mahasiswa/i berprestasi Universitas XYZ,\r\n\r\nKami dengan senang hati mengumumkan bahwa telah dibuka pendaftaran Beasiswa Prestasi untuk Semester Ganjil tahun ajaran 2023/2024. Beasiswa ini diperuntukkan bagi mahasiswa/i yang memiliki prestasi akademik yang luar biasa dan aktif berkontribusi dalam kegiatan kampus.\r\n\r\nInformasi Beasiswa:\r\n\r\nJumlah Beasiswa: 10 orang mahasiswa/i terbaik\r\nBesar Beasiswa: Rp 5.000.000,- per mahasiswa/i\r\nSyarat dan ketentuan berlaku\r\nSilakan segera ajukan pendaftaran melalui portal beasiswa kami. Batas akhir pendaftaran adalah tanggal 20 Juli 2023. Tim seleksi akan melakukan penilaian dan pengumuman penerimaan beasiswa akan dilakukan pada tanggal 30 Juli 2023.\r\n\r\nSemoga kesempatan ini dapat menjadi motivasi untuk terus berprestasi dalam akademik dan non-akademik. Sukses untuk para calon penerima beasiswa!', '2023-07-25')

    public function hapusMatkul($id){
        $model = new MatakuliahModel;
        $model->delete($id);
---
DELETE FROM `matakuliah`
WHERE `id` IN ('27')

    public function semuaDosen(){
        $model = new DosenModel;
        $data['semua_dosen'] = $model->findAll();
---
SELECT *
FROM `dosen`

    public function semuaMahasiswa(){
        $model = new MahasiswaModel;
        $data['semua_mahasiswa'] = $model->findAll();
---
SELECT *
FROM `mahasiswa`